routes/web.php

select * from `users`
select count(*) as aggregate from `users`
select * from `users` where `users`.`id` = 144 limit 1
select count(*) as user_count, name from `users` where `id` > 10 group by `name`
---
|
*/

Route::get('/', function () {

    $users = DB::table('users')->select(DB::raw('count(*) as user_count, name'))
        ->where('id','>',10)
        ->groupBy('name')
        ->get();

    return view('users',[
        'users' => $users,
    ]);
});